import random

syllables = [
    'ба', 'бе', 'би', 'бо', 'бу', 'бы', 'бь', 'бя', 'бю',
    'ва', 'ве', 'ви', 'во', 'ву', 'вы', 'вь', 'вя', 'вю',
    'га', 'ге', 'ги', 'го', 'гу', 'гы', 'гь', 'гя', 'гю',
    'да', 'де', 'ди', 'до', 'ду', 'ды', 'дь', 'дя', 'дю',
    'жа', 'же', 'жи', 'жо', 'жу', 'жы', 'жь', 'жя', 'жю',
    'за', 'зе', 'зи', 'зо', 'зу', 'зы', 'зь', 'зя', 'зю',
    'ка', 'ке', 'ки', 'ко', 'ку', 'кы', 'кь', 'кя', 'кю',
    'ла', 'ле', 'ли', 'ло', 'лу', 'лы', 'ль', 'ля', 'лю',
    'ма', 'ме', 'ми', 'мо', 'му', 'мы', 'мь', 'мя', 'мю',
    'на', 'не', 'ни', 'но', 'ну', 'ны', 'нь', 'ня', 'ню',
    'па', 'пе', 'пи', 'по', 'пу', 'пы', 'пь', 'пя', 'пю',
    'ра', 'ре', 'ри', 'ро', 'ру', 'ры', 'рь', 'ря', 'рю',
    'са', 'се', 'си', 'со', 'су', 'сы', 'сь', 'ся', 'сю',
    'та', 'те', 'ти', 'то', 'ту', 'ты', 'ть', 'тя', 'тю',
    'фа', 'фе', 'фи', 'фо', 'фу', 'фы', 'фь', 'фя', 'фю',
    'ха', 'хе', 'хи', 'хо', 'ху', 'хы', 'хь', 'хя', 'хю',
    'ца', 'це', 'ци', 'цо', 'цу', 'цы', 'ць', 'ця', 'цю',
    'ча', 'че', 'чи', 'чо', 'чу', 'чы', 'чь', 'чя', 'чю',
    'ша', 'ше', 'ши', 'шо', 'шу', 'шы', 'шь', 'шя', 'шю',
    'ща', 'ще', 'щи', 'що', 'щу', 'щы', 'щь', 'щя', 'щю'
]

def gen_words(count = 100):
    words = []
    for _ in range(count):
        num_syllables = random.randint(3, 5)
        word = ''.join(random.choices(syllables, k=num_syllables))
        words.append(word)

    return words


if __name__ == "__main__":
    with open("tests/assets/words_1k.txt", "w", encoding="utf-8") as f:
        f.write(" ".join(gen_words(1000)))